---
kind: other
id: Properties.T:Autodesk.Revit.DB.ElementClassFilter
source: html/cc5e427a-117c-a9c4-3f47-3819e63edcb7.htm
---
# ElementClassFilter Properties

True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected,
 and elements that would normally be rejected will be accepted.